w-dee/esp-np2kai/firmware/sdkconfig.defaults
CONFIG_IDF_TARGET="esp32p4"
CONFIG_ESP_CONSOLE_UART_DEFAULT=y
CONFIG_COMPILER_CXX_EXCEPTIONS=n
CONFIG_COMPILER_CXX_RTTI=n

# Verified with esp-emu v0.39.0, which reports ESP32-P4 revision v3.1.
# Physical P4-NANO and TAB5 revision compatibility remains unverified.
CONFIG_ESP32P4_REV_MIN_301=y
